app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @cart = Cart.find(params[:id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "carts" SET "submitted" = ? WHERE "carts"."id" = ?  [["submitted", "t"], ["id", 1]]
---
    def checkout
      @current_cart = Cart.find(params[:id])
      @current_cart.submit_cart
      @current_cart.update_inventory