app/controllers/line_items_controller.rb

  def create
    if current_user && current_user.current_cart
      @cart = current_user.current_cart
    elsif current_user
      @cart = current_user.create_current_cart(current_user.id)
---
INSERT INTO "carts" ("user_id") VALUES (?)  [["user_id", 1]]